# WAVES

In [1]:
import pyodbc
import pandas as pd

In [2]:
cnxn = pyodbc.connect("Driver={ODBC Driver 17 for SQL Server};"
                        "Server=wd02;"
                        "Database=FootPrint;"
                        "UID=WOODFIELD\\jmeza@wdsrx.com;"
                        "PWD=Clavezaza2022;"
                        "Trusted_Connection=yes;")

### Query

In [3]:
df = pd.read_sql_query("SELECT CONVERT(varchar,w.releaseDate,100) Date, w.id, wa.name Warehouse, s.lookupCode Shipments, p.name Customer, ss.name ShipmentStatus\
    FROM datex_footprint.Waves w\
    JOIN datex_footprint.WaveStatuses ws\
        ON ws.id = w.statusId\
    JOIN datex_footprint.Warehouses wa\
        ON wa.id = w.warehouseId\
    JOIN datex_footprint.shipments s\
        ON s.waveId = w.id\
    JOIN datex_footprint.ShipmentOrderLookup sol\
        ON sol.shipmentId = s.id\
    JOIN datex_footprint.Orders o\
        ON o.id = sol.orderId\
    JOIN datex_footprint.Projects p\
        ON p.id = o.projectId\
    JOIN datex_footprint.ShipmentStatuses ss\
        ON ss.id = s.statusId\
    WHERE releaseDate > dateadd(day,-1,getdate())\
        AND w.statusId = 3\
    ORDER BY releaseDate DESC", cnxn)

# Create Waves Table Data

In [4]:
df.head(10)

,Date,id,Warehouse,Shipments,Customer,ShipmentStatus
0,Jan 9 2023 8:58AM,254526,10,SNAP15322804,"Snap Medical Industries, LLC",Released
1,Jan 9 2023 8:58AM,254526,10,SNAP16231,"Snap Medical Industries, LLC",Released
2,Jan 9 2023 8:58AM,254525,12,U1173.1,"Uniderm USA, Inc",Released
3,Jan 9 2023 8:55AM,254524,10,9008869,"Snap Medical Industries, LLC",Released
4,Jan 9 2023 8:55AM,254524,10,9008870,"Snap Medical Industries, LLC",Released
5,Jan 9 2023 8:55AM,254524,10,9008871,"Snap Medical Industries, LLC",Released
6,Jan 9 2023 8:55AM,254524,10,9008872,"Snap Medical Industries, LLC",Released
7,Jan 9 2023 8:55AM,254524,10,9008873,"Snap Medical Industries, LLC",Released
8,Jan 9 2023 8:55AM,254524,10,9008874,"Snap Medical Industries, LLC",Released
9,Jan 9 2023 8:54AM,254521,12,HH-39244,Hush Hush,Released

In [5]:
# Count Shipments per Wave and Status
count_shipments_statusdf = df.groupby(['id', 'ShipmentStatus']).count()[['Shipments']]
count_shipments_statusdf.reset_index(inplace=True)
count_shipments_statusdf.tail()

        id ShipmentStatus  Shipments
9   254521       Released         40
10  254522       Released          1
11  254524       Released          6
12  254525       Released          1
13  254526       Released          2

In [6]:
# Convert Statuses to Columns
shipment_pivot = count_shipments_statusdf.pivot(index='id', columns='ShipmentStatus', values='Shipments')
shipment_pivot.tail()

ShipmentStatus  Completed  Released
id
254521                NaN      40.0
254522                NaN       1.0
254524                NaN       6.0
254525                NaN       1.0
254526                NaN       2.0

In [7]:
# Convert NaN to 0
shipment_pivot = shipment_pivot.fillna(0)
shipment_pivot.head()

ShipmentStatus  Completed  Released
id
254504                0.0       2.0
254505                2.0       9.0
254511                0.0       8.0
254512                0.0      11.0
254516                0.0       9.0

In [8]:
# Convert Float to Int
try:
    shipment_pivot['Completed'] = shipment_pivot['Completed'].astype(int)
except:
    print('Column Completed does not exist yet')

try:
    shipment_pivot['Executing'] = shipment_pivot['Executing'].astype(int)
except:
    print('Column Executing does not exist yet')

try:
    shipment_pivot['Released'] = shipment_pivot['Released'].astype(int)
except:
    print('Column Released does not exist yet')

shipment_pivot.head()

Column Executing does not exist yet

ShipmentStatus  Completed  Released
id
254504                  0         2
254505                  2         9
254511                  0         8
254512                  0        11
254516                  0         9

In [9]:
# Convert id index to a column
shipment_pivot.reset_index(inplace=True)
shipment_pivot.head()

ShipmentStatus      id  Completed  Released
0               254504          0         2
1               254505          2         9
2               254511          0         8
3               254512          0        11
4               254516          0         9

In [10]:
# Convert zeros to blanks. This also change the data type to String
try:
    shipment_pivot['Completed'].replace([0, ''], '', inplace=True)
except:
    print('Column Completed does not exist yet')
    
try:
    shipment_pivot['Executing'].replace([0, ''], '', inplace=True)
except:
    print('Column Executing does not exist yet')

try:
    shipment_pivot['Released'].replace([0, ''], '', inplace=True)
except:
    print('Column Released does not exist yet')
    
shipment_pivot.head()

Column Executing does not exist yet

ShipmentStatus      id Completed  Released
0               254504                   2
1               254505         2         9
2               254511                   8
3               254512                  11
4               254516                   9

In [11]:
shipment_pivot.dtypes

ShipmentStatus
id            int64
Completed    object
Released      int32
dtype: object

In [12]:
# Change columns order
df = df[['Date', 'id', 'Warehouse', 'Customer']]

In [13]:
# Drops duplicates
df = df.drop_duplicates()

In [14]:
df.head(10)

                   Date      id Warehouse                        Customer
0   Jan  9 2023  8:58AM  254526        10    Snap Medical Industries, LLC
2   Jan  9 2023  8:58AM  254525        12                Uniderm USA, Inc
3   Jan  9 2023  8:55AM  254524        10    Snap Medical Industries, LLC
9   Jan  9 2023  8:54AM  254521        12                       Hush Hush
49  Jan  9 2023  8:51AM  254522        12                       Hush Hush
50  Jan  9 2023  8:46AM  254519        22               NBTY Global, Inc.
51  Jan  9 2023  8:46AM  254518        22               NBTY Global, Inc.
52  Jan  9 2023  8:44AM  254517        20  Granules Pharmaceuticals, Inc.
53  Jan  9 2023  8:43AM  254516        10               ISDIN Corporation
62  Jan  9 2023  8:30AM  254504        10                     Emerginnova

In [15]:
# Merge df with pivot table
df2 = df.merge(shipment_pivot, left_on='id', right_on='id')
df2.head(10)

,Date,id,Warehouse,Customer,Completed,Released
0,Jan 9 2023 8:58AM,254526,10,"Snap Medical Industries, LLC",,2
1,Jan 9 2023 8:58AM,254525,12,"Uniderm USA, Inc",,1
2,Jan 9 2023 8:55AM,254524,10,"Snap Medical Industries, LLC",,6
3,Jan 9 2023 8:54AM,254521,12,Hush Hush,,40
4,Jan 9 2023 8:51AM,254522,12,Hush Hush,,1
5,Jan 9 2023 8:46AM,254519,22,"NBTY Global, Inc.",,1
6,Jan 9 2023 8:46AM,254518,22,"NBTY Global, Inc.",,1
7,Jan 9 2023 8:44AM,254517,20,"Granules Pharmaceuticals, Inc.",,1
8,Jan 9 2023 8:43AM,254516,10,ISDIN Corporation,,9
9,Jan 9 2023 8:30AM,254504,10,Emerginnova,,2

In [16]:
wave_df = pd.DataFrame()
statuses = list(df2.columns)

# Reorder columns
if ('Released' in statuses) and ('Executing' in statuses) and ('Completed' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Executing', 'Completed']]
elif ('Released' in statuses) and ('Executing' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Executing']]
elif ('Released' in statuses) and ('Completed' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Completed']]
elif ('Released' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released']]
else:
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer']]

In [17]:
wave_df.head(10)

,Date,id,Warehouse,Customer,Released,Completed
0,Jan 9 2023 8:58AM,254526,10,"Snap Medical Industries, LLC",2,
1,Jan 9 2023 8:58AM,254525,12,"Uniderm USA, Inc",1,
2,Jan 9 2023 8:55AM,254524,10,"Snap Medical Industries, LLC",6,
3,Jan 9 2023 8:54AM,254521,12,Hush Hush,40,
4,Jan 9 2023 8:51AM,254522,12,Hush Hush,1,
5,Jan 9 2023 8:46AM,254519,22,"NBTY Global, Inc.",1,
6,Jan 9 2023 8:46AM,254518,22,"NBTY Global, Inc.",1,
7,Jan 9 2023 8:44AM,254517,20,"Granules Pharmaceuticals, Inc.",1,
8,Jan 9 2023 8:43AM,254516,10,ISDIN Corporation,9,
9,Jan 9 2023 8:30AM,254504,10,Emerginnova,2,

In [18]:
# Save Waves DF into json file
wave_df.to_json('data/waves.json')

# Warehouse Pie Chart Data

In [19]:
# Save df2 in df3
warehouse_df = wave_df
warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Completed
0,Jan 9 2023 8:58AM,254526,10,"Snap Medical Industries, LLC",2,
1,Jan 9 2023 8:58AM,254525,12,"Uniderm USA, Inc",1,
2,Jan 9 2023 8:55AM,254524,10,"Snap Medical Industries, LLC",6,
3,Jan 9 2023 8:54AM,254521,12,Hush Hush,40,
4,Jan 9 2023 8:51AM,254522,12,Hush Hush,1,

In [20]:
# Conver String to Float
try:
    warehouse_df['Released'] = pd.to_numeric(warehouse_df['Released'],errors='coerce')
except:
    print('Column Released does not exist yet')

try:
    warehouse_df['Executing'] = pd.to_numeric(warehouse_df['Executing'],errors='coerce')
except:
    print('Column Executing does not exist yet')

try:
    warehouse_df['Completed'] = pd.to_numeric(warehouse_df['Completed'],errors='coerce')
except:
    print('Column Completed does not exist yet')

warehouse_df.head()

Column Executing does not exist yet

,Date,id,Warehouse,Customer,Released,Completed
0,Jan 9 2023 8:58AM,254526,10,"Snap Medical Industries, LLC",2,NaN
1,Jan 9 2023 8:58AM,254525,12,"Uniderm USA, Inc",1,NaN
2,Jan 9 2023 8:55AM,254524,10,"Snap Medical Industries, LLC",6,NaN
3,Jan 9 2023 8:54AM,254521,12,Hush Hush,40,NaN
4,Jan 9 2023 8:51AM,254522,12,Hush Hush,1,NaN

In [21]:
# Conver NaN to Zero
warehouse_df = warehouse_df.fillna(0)
warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Completed
0,Jan 9 2023 8:58AM,254526,10,"Snap Medical Industries, LLC",2,0.0
1,Jan 9 2023 8:58AM,254525,12,"Uniderm USA, Inc",1,0.0
2,Jan 9 2023 8:55AM,254524,10,"Snap Medical Industries, LLC",6,0.0
3,Jan 9 2023 8:54AM,254521,12,Hush Hush,40,0.0
4,Jan 9 2023 8:51AM,254522,12,Hush Hush,1,0.0

In [22]:
# Group by Warehouse
warehouse_df = warehouse_df.groupby(['Warehouse']).sum()
warehouse_df

                id  Released  Completed
Warehouse
10         1272575        28        2.0
12          763568        42        0.0
19          509023        19        0.0
20          254517         1        0.0
22          509037         2        0.0

In [23]:
# Reset Index
warehouse_df.reset_index(inplace=True)
warehouse_df

  Warehouse       id  Released  Completed
0        10  1272575        28        2.0
1        12   763568        42        0.0
2        19   509023        19        0.0
3        20   254517         1        0.0
4        22   509037         2        0.0

In [24]:
warehouses = list(warehouse_df.columns)
warehouse_df2 = pd.DataFrame()

if ('Released' in warehouses) and ('Executing' in warehouses) and ('Completed' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Executing', 'Completed']]
elif ('Released' in warehouses) and ('Executing' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Executing']]
elif ('Released' in warehouses) and ('Completed' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Completed']]
elif ('Released' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released']]
else:
    warehouse_df2 = warehouse_df[['Warehouse']]

warehouse_df2

  Warehouse  Released  Completed
0        10        28        2.0
1        12        42        0.0
2        19        19        0.0
3        20         1        0.0
4        22         2        0.0

In [25]:
warehouse_df2 = pd.melt(warehouse_df2, id_vars=["Warehouse"], 
                  var_name="Status", value_name="Value")
warehouse_df2.head()

  Warehouse    Status  Value
0        10  Released   28.0
1        12  Released   42.0
2        19  Released   19.0
3        20  Released    1.0
4        22  Released    2.0

In [26]:
warehouse_df3 = warehouse_df2.pivot(index ='Status', columns='Warehouse', values='Value')
warehouse_df3

Warehouse    10    12    19   20   22
Status
Completed   2.0   0.0   0.0  0.0  0.0
Released   28.0  42.0  19.0  1.0  2.0

In [27]:
warehouse_df4 = warehouse_df3.reset_index()
warehouse_df4

Warehouse     Status    10    12    19   20   22
0          Completed   2.0   0.0   0.0  0.0  0.0
1           Released  28.0  42.0  19.0  1.0  2.0

In [28]:
warehouse_df4 = warehouse_df4.rename_axis(None, axis=1)
warehouse_df4

      Status    10    12    19   20   22
0  Completed   2.0   0.0   0.0  0.0  0.0
1   Released  28.0  42.0  19.0  1.0  2.0

In [29]:
# Save Warehouse into JSON file
warehouse_df4.to_json('data/warehouse.json')

In [30]:
# Close connection
cnxn.close()